{
  "很遗憾您这没有能用的显卡来支持您训练": "Unfortunately, you don't have a graphics card that supports model training.",
  "是": "Yes",
  "step1:正在处理数据": "Step 1: Data Processing معالجة البيانات",
  "step2a:无需提取音高": "Step 2a: Skip key pull",
  "step2b:正在提取特征": "Step 2b: Pulling out features سحب السمات",
  "step3a:正在训练模型": "Step 3a: Start Model Training بدأ تدريب النموذج",
  "训练结束, 您可查看控制台训练日志或实验文件夹下的train.log": "Training completed. You can check the training logs in the console or in the 'train.log' file in the model folder.(تم الإنتهاء من التدريب)",
  "全流程结束！": "All processes are completed! جميع العمليات تمت",
  "本软件以MIT协议开源, 作者不对软件具备任何控制力, 使用软件者、传播软件导出的声音者自负全责. <br>如不认可该条款, 则不能使用或引用软件包内任何代码和文件. 详见根目录<b>LICENSE</b>.": "<b>The script was translated and updated by https://www.youtube.com/@MohamedElmazen</b>.",
  "模型推理": "Model inference  نموذج الاستدلال",
  "推理音色": "Voice processing: فحص الصوت",
  "刷新音色列表和索引路径": "Update list of Models تحديث قائمة النماذج",
  "卸载音色省显存": "Unload voice to save video card memory إلغاء تحميل الصوت",
  "请选择说话人id": "Select voice id:",
  "男转女推荐+12key, 女转男推荐-12key, 如果音域爆炸导致音色失真也可以自己调整到合适音域. ": "Recommended [+12 for male to female conversion] and [-12 for female to male conversion] [0 for same male>>male or female>>female] ([صوت رجل إلى صوت إنثى +12] [صوت إنثى إلى صوت رجل -12] [0 لنفس النوع] قم بظبط القيمة حتى تصل إلى أقرب نتيجة)",
  "变调(整数, 半音数量, 升八度12降八度-12)": "Voice pitch (number, semitones, raise an octave: 12, lower an octave: -12) ([الجواب 12] [القرار -12] طبقة الصوت ما بين الجواب والقرار حيث 12 هي الصوت الضخم والقرار هو الصوت المنخفض أو الناعم):",
  "输入待处理音频文件路径(默认是正确格式示例)": "Enter the path to the audio file you want to process (the correct format is entered by default):",
  "选择音高提取算法,输入歌声可用pm提速,harvest低音好但巨慢无比,crepe效果好但吃GPU": "Select a key extraction algorithm ('pm': fast extraction but worse speech quality; 'harvest': better bass but very slow; 'crepe': better quality but heavily uses graphics card):",
  ">=3则使用对harvest音高识别的结果使用中值滤波，数值为滤波半径，使用可以削弱哑音": "If greater than 3: apply median filtering to the pulled keys. The value controls the radius of the filter and can reduce overbreathing.",
  "特征检索库文件路径,为空则使用下拉的选择结果": "The path to the train index file. Leave blank to use the selected result from the list:",
  "自动检测index路径,下拉式选择(dropdown)": "Automatically find the path to the index and select it from the list:",
  "特征文件路径": "File path مسار الملف:",
  "检索特征占比": "Trait Search Ratio:",
  "后处理重采样至最终采样率，0为不进行重采样": "Change the sample rate in the output file to the final one. Set to 0 for nothing to change:",
  "输入源音量包络替换输出音量包络融合比例，越靠近1越使用输出包络": "Use the volume of the input file to replace or shuffle with the volume of the output file. The closer the ratio is to 1, the more sound from the output file is used:",
  "保护清辅音和呼吸声，防止电音撕裂等artifact，拉满0.5不开启，调低加大保护力度但可能降低索引效果": "Protect voiceless consonants and breath sounds to prevent artifacts such as tearing in electronic music. Set to 0.5 to turn off. Decrease the value to improve security, but indexing accuracy may be degraded:",
  "F0曲线文件, 可选, 一行一个音高, 代替默认F0及升降调": "F0 arc file (optional). One tone per line. Replaces normal F0 and key modulation:",
  "转换": "Convert تحويل",
  "输出信息": "Log سجل النتائج",
  "输出音频(右下角三个点,点了可以下载)": "Export audio file (click on the three dots in the lower right corner to download)",
  "批量转换, 输入待转换音频文件夹, 或上传多个音频文件, 在指定文件夹(默认opt)下输出转换的音频. ": "Convert in batches. Enter the path to the folder where the files to be converted are located or upload several audio files. The converted files will be saved in the specified folder (default is 'opt').",
  "指定输出文件夹": "Specify output folder:",
  "输入待处理音频文件夹路径(去文件管理器地址栏拷就行了)": "Enter the path to the audio folder for processing:",
  "也可批量输入音频文件, 二选一, 优先读文件夹": "You can also upload audio files in batches. Choose one of the two. Priority is given to reading from the folder.",
  "导出文件格式": "Output file format",
  "伴奏人声分离&去混响&去回声": "Vocal/instrumental separation and echo removal",
  "人声伴奏分离批量处理， 使用UVR5模型。 <br>合格的文件夹路径格式举例： E:\\codes\\py39\\vits_vc_gpu\\白鹭霜华测试样例(去文件管理器地址栏拷就行了)。 <br>模型分为三类： <br>1、保留人声：不带和声的音频选这个，对主人声保留比HP5更好。内置HP2和HP3两个模型，HP3可能轻微漏伴奏但对主人声保留比HP2稍微好一丁点； <br>2、仅保留主人声：带和声的音频选这个，对主人声可能有削弱。内置HP5一个模型； <br> 3、去混响、去延迟模型（by FoxJoy）：<br>  (1)MDX-Net(onnx_dereverb):对于双通道混响是最好的选择，不能去除单通道混响；<br>&emsp;(234)DeEcho:去除延迟效果。Aggressive比Normal去除得更彻底，DeReverb额外去除混响，可去除单声道混响，但是对高频重的板式混响去不干净。<br>去混响/去延迟，附：<br>1、DeEcho-DeReverb模型的耗时是另外2个DeEcho模型的接近2倍；<br>2、MDX-Net-Dereverb模型挺慢的；<br>3、个人推荐的最干净的配置是先MDX-Net再DeEcho-Aggressive。": "Batch processing for splitting vocal accompaniment using the UVR5 model.<br>Example of valid folder path format: D:\\path\\to\\input\\folder<br> The model is divided into three categories:<br>1. Keep Vocals: Select this option for audio without harmonies. It retains vocals better than the HP5. It includes two built-in models: HP2 and HP3. The HP3 may skip the instrumental a bit, but retains the vocals a bit better than the HP2.<br>2. Keep Lead Vocals Only: Select this option for a sound with harmonies. This can weaken the main vocal. It includes one built-in model: HP5.<br>3. Reverb and Delay Removal Models (by FoxJoy):<br>  (1) MDX-Net: Best choice for stereo reverb removal, but it cannot remove mono reverb;<br>&emsp;(234) DeEcho: Removes delay effects. Aggressive mode removes more thoroughly than Normal mode. DeReverb additionally removes reverb and can remove mono reverb, but is not very effective for highly reverb high frequency content.<br>Notes on reverb removal",
  "输入待处理音频文件夹路径": "Enter the path to the folder with audio files for processing:",
  "模型": "Models النماذج",
  "指定输出主人声文件夹": "Enter the path to the folder for vocals:",
  "指定输出非主人声文件夹": "Enter the path to the folder for the instrumental:",
  "训练": "Training التدريب",
  "step1: 填写实验配置. 实验数据放在logs下, 每个实验一个文件夹, 需手工输入实验名路径, 内含实验配置, 日志, 训练得到的模型文件. ": "Step 1: Fill in the model settings. The model data is saved in the 'logs' folder and a separate folder is created for each model. Manually enter the path to the settings for the model where the logs and training files are located.",
  "输入实验名": "Enter model name: أدخل إسم النموذج",
  "目标采样率": "Model sample rate: معدل العينة للنموذج",
  "模型是否带音高指导(唱歌一定要, 语音可以不要)": "Model key guidance مفاتيح توجهية للنموذج",
  "版本": "Version إصدار",
  "提取音高和处理数据使用的CPU进程数": "Number of CPU processes used to extract keys and process data عدد وحدات المعالج",
  "step2a: 自动遍历训练文件夹下所有可解码成音频的文件并进行切片归一化, 在实验目录下生成2个wav文件夹; 暂时只支持单人训练. ": "Step 2a: Automatically go through all the audio files in the workout folder and normalize the chunks. Will create 2 wav folders in the model folder. Only one voice training is supported at this time.",
  "输入训练文件夹路径": "Enter the path to the training folder: مسار مجلد التدريب",
  "请指定说话人id": "Enter voice id رقم المتحدث",
  "处理数据": "Prepare datasets تحضير البيانات",
  "step2b: 使用CPU提取音高(如果模型带音高), 使用GPU提取特征(选择卡号)": "Step 2b: Pull out the keys with the help of the processor (if the model has keys), pull out the features with the help of the video card (choose which one):",
  "以-分隔输入使用的卡号, 例如   0-1-2   使用卡0和卡1和卡2": "Enter which video card(s) you want to use separated by '-', for example 0-1-2 to use video card 0, 1 and 2:",
  "显卡信息": "GPU cards بطاقات الرسوم",
  "选择音高提取算法:输入歌声可用pm提速,高质量语音但CPU差可用dio提速,harvest质量更好但慢": "Select a key extraction algorithm ('pm': fast extraction but worse speech quality; 'harvest': better bass but very slow; 'crepe': better quality but heavily uses graphics card):",
  "特征提取": "Pulling features سحب الميزات",
  "step3: 填写训练设置, 开始训练模型和索引": "Step 3: Fill in the rest of the training settings and start training the model and index",
  "保存频率save_every_epoch": "Save frequency (save every epoch): معدل الحفظ",
  "总训练轮数total_epoch": "Total number of epochs (total_epoch): إجمالي عدد حقب التدريب",
  "每张显卡的batch_size": "Pack size for video card: حجم الحزمة لبطاقة الرسوم",
  "是否仅保存最新的ckpt文件以节省硬盘空间": "Keep only the latest '.ckpt' file to save disk space?: حفظ أخر ملف فقط لتوفير مساحة؟",
  "否": "No",
  "是否缓存所有训练集至显存. 10min以下小数据可缓存以加速训练, 大数据缓存会炸显存也加不了多少速": "Cache all training sets to video memory. Caching small datasets (less than 10 minutes) can speed up training, but caching large datasets, on the contrary, will take up a lot of video memory and will not speed up training much: إختار لا فهذه الميزة تقوم بتحميل البيانات على وحدة الرسوم وهي لا توفر في الوقت وتستهلك من وحدة الرسوم كثيرا",
  "是否在每次保存时间点将最终小模型保存至weights文件夹": "Save a small final model to the 'weights' folder on each savepoint:",
  "加载预训练底模G路径": "The Path to the Trained Base Model G:",
  "加载预训练底模D路径": "The path to the trained base model D:",
  "训练模型": "Train Model تدريب النموذج",
  "训练特征索引": "Train features index تدريب السمات",
  "一键训练": "One Touch Train التدريب بضغطة واحدة",
  "ckpt处理": "Processing ckpt",
  "模型融合, 可用于测试音色融合": "Model fusion, can be used to test timbre fusion",
  "A模型路径": "Path to Model A:",
  "B模型路径": "Path to model B:",
  "A模型权重": "Weight (w) model A:",
  "模型是否带音高指导": "Does the model have pitch guidance (1: yes, 0: no):",
  "要置入的模型信息": "Model information:",
  "保存的模型名不带后缀": "Name of the saved model (without extension):",
  "模型版本型号": "Model architecture version:",
  "融合": "merger",
  "修改模型信息(仅支持weights文件夹下提取的小模型文件)": "Modify model information (only supported for small models taken from the 'weights' folder)",
  "模型路径": "Folder path:",
  "要改的模型信息": "Information about the model to be modified:",
  "保存的文件名, 默认空为和源文件同名": "The name of the saved file (the default is the same as the input file):",
  "修改": "Modify",
  "查看模型信息(仅支持weights文件夹下提取的小模型文件)": "View model information (only supported for small models taken from the 'weights' folder)",
  "查看": "View",
  "模型提取(输入logs文件夹下大文件模型路径),适用于训一半不想训了模型没有自动提取保存小文件模型,或者想测试中间模型的情况": "Pulling the model (enter the path to the large model file in the 'logs' folder). Useful if you need to complete a train and manually retrieve and save a small model file, or if you need to check an unfinished model:",
  "保存名": "Saved file name:",
  "模型是否带音高指导,1是0否": "Does the model have pitch guidance (1: yes, 0: no):",
  "提取": "pull out",
  "Onnx导出": "Export Onnx",
  "RVC模型路径": "Path to RVC model:",
  "Onnx输出路径": "Path for exported Onnx:",
  "导出Onnx模型": "Export Onnx Model",
  "常见问题解答": "FAQ (Frequently Asked Questions)",
  "招募音高曲线前端编辑器": "Using frontend editors for tonal arcs",
  "加开发群联系我xxxxx": "Join the development team and contact me at Mazen VR",
  "点击查看交流、问题反馈群号": "Click to view comm group number and issue feedback",
  "xxxxx": "xxxxx",
  "加载模型": "Download Model",
  "Hubert模型": "Hubert Model",
  "选择.pth文件": "Select .pth file",
  "选择.index文件": "Select .index file",
  "选择.npy文件": "Select .npy file",
  "输入设备": "input device",
  "输出设备": "output device",
  "音频设备(请使用同种类驱动)": "Audio device (please use same=same driver type)",
  "响应阈值": "Response threshold",
  "音调设置": "Key settings",
  "Index Rate": "Index Rate",
  "常规设置": "basic settings",
  "采样长度": "Sample length",
  "淡入淡出长度": "Decay length",
  "额外推理时长": "Add. processing time",
  "输入降噪": "Noise reduction in input information",
  "输出降噪": "Noise reduction in output information",
  "性能设置": "Speed settings",
  "开始音频转换": "Start audio conversion",
  "停止音频转换": "Finish audio conversion",
  "推理时间(ms):": "Processing time (ms):",
  "请选择pth文件": "Please select pth file",
  "请选择index文件": "Please select index file",
  "hubert模型路径不可包含中文": "The hubert model path cannot contain Arabic",
  "pth文件路径不可包含中文": "pth file path cannot contain Arabic",
  "index文件路径不可包含中文": "The index file path cannot contain Arabic",
  "音高算法": "pitch algorithm",
  "harvest进程数": "Number of harvest processes"
}